// 你现在是一场采用特殊赛制棒球比赛的记录员。这场比赛由若干回合组成，过去几回合的得分可能会影响以后几回合的得分。比赛开始时，记录是空白的。你会得到一个记录操作的字符串数组 ops，其中 ops[i] 是你需要记录的第 i 项操作，题目数据保证记录某操作前面总是存在足够数量的有效的分数，请你返回记录中所有得分的总和。ops 遵循下述规则：1.整数 x - 表示本回合新获得分数 x

// 2."+" - 表示本回合新获得的得分是前两次得分的总和。

// 3."D" - 表示本回合新获得的得分是前一次得分的两倍。

// 4."C" - 表示前一次得分无效，将其从记录中移除。

 

// 例如：ops = ["5","-2","4","C","D","9","+","+"]

// 解释：

// "5" - 得分加5 ，记录现在是 [5]

// "-2" - 得分加-2 ，记录现在是 [5, -2]

// "4" - 得分加4 ，记录现在是 [5, -2, 4]

// "C" - 撤销加分，使前一次得分的记录无效并将其移除，记录现在是 [5, -2]

// "D" - 得分加2 * -2 = -4 ，记录现在是 [5, -2, -4]

// "9" - 得分加9 ，记录现在是 [5, -2, -4, 9]

// "+" - 得分加-4 + 9 = 5 ，记录现在是 [5, -2, -4, 9, 5]

// "+" - 得分加9 + 5 = 14 ，记录现在是 [5, -2, -4, 9, 5, 14]

// 所有得分的总和 5 + -2 + -4 + 9 + 5 + 14 = 27

 

// main函数测试代码如下：

#include <bits/stdc++.h>
using namespace std;



int main() {
    string line;
    // 逐行读取
    while (getline(cin, line)) {
        vector<string> ops; // 存储所有操作
	stringstream ss(line); // 把这一行变成流，需要#include <sstream>
        string s;
        // 按空格分割，存入当前行的数组
        while (ss >> s) {
            ops.push_back(s);
        }
	cout << calPoints(ops) << endl;
    }
}